---
kind: method
id: M:Autodesk.Revit.UI.PulldownButton.AddSeparator
source: html/fb9f015a-4cb5-f212-7f19-993621e90e9d.htm
---
# Autodesk.Revit.UI.PulldownButton.AddSeparator Method

Adds a separator to the drop-down list.

## Syntax (C#)
```csharp
public void AddSeparator()
```

## Remarks
The separator will appear just below the last added PushButton.